CATEGORY_NOT_FOUND = "❌ Категория {category} не найдена. Что сделать?"
ADDED_SUCCESSFULLY = (
    "✅ Добавлено:\n{date} | {category} | {amount} EUR | {comment}"
    "\n\nТы молодец — траты под контролем, так держать! 💸📊"
)
MULTIPLE_CATEGORIES = "Найдено несколько категорий, выберите нужную:"
CATEGORY_ADDED = "📌Категория '{category}' добавлена и запись сохранена!"
CATEGORY_ADDED_ERROR = "⚠️ Не удалось добавить категорию: {error}"
CATEGORIES_LIST = "Вот список ваших категорий:\n\n{categories_text}"
